// แสดงโปรเจคทั้งหมดที่ถูกแอดเข้ามา แสดงสถานะว่าผ่านเจค1แล้ว หรือผ่านเจค2แล้ว ถ้ายังไม่ผ่านให้แสดงว่าทำไมยังไม่ผ่าน(ติดอะไร)
// หน้านี้ต้องค้นหาจากปีการศึกษา ชื่อเจค ชื่อนศ รหัสนศ


// เหตุผลที่ยังไม่ผ่านเจค 1 หลักๆคือ ยังไม่ยื่นสอบ ยังไม่แต่งตั้ง ได้เกรดip ได้เอฟ
// เหตุผลที่ยังไม่ผ่านเจค 2 หลักๆคือ ยังสอบอิ๊งไม่ครบคู่ ยังไม่ทดลอง ยังไม่ยื่นสอบ ได้เกรดip ได้เอฟ


// ทั้ง2เจคจะมีเกรดได้ก็ต่อเมื่อ มีเอกสารต่างๆครบถ้วน (ยกเว้นอิ๊งที่ไม่ครบแต่สามารถสอบเจค2ได้และมีเกรดแต่ยังไม่จบ)


// เกรดที่ผ่านจะต้องเป็นเกรด A,B+,B,C+,C,D+,D เท่านั้น และจะต้องได้เกรดพร้อมกัน แต่อาจจะไม่เหมือนกันได้
// กรณีเกรด Ip จะต้องติดทั้งคู่(ให้ใส่หมายเหตุด้วย) (กรณีคนนึงเกรดปกติ คนนึงip เป็นไปไม่ได้)


// กรณีผ่านเจค1 เพราะ
// แต่งตั้งและยื่นสอบแล้ว -> เช็คว่ามีเกรดแล้ว ถ้ามีเกรดแล้ว -> ขึ้นว่า ผ่านโปรเจค1แล้ว 

// กรณีผ่านเจค1มาแล้ว ให้มาเช็คตามนี้
// ผลสอบอิ๊งไม่ครบ(ใส่หมายเหตุว่าทำไมไม่ครบ เด็กคนไหนขาดผลสอบ) ทดลองแล้ว ยื่นสอบแล้ว เกรดออกแล้ว -> ขึ้นว่า ผ่านเจค2แล้ว
// ผลอิ๊งครบ ทดลองแล้ว ยื่นสอบแล้ว เกรดออกแล้ว -> ขึ้นว่า ผ่านโปรเจค2แล้ว


// กรณีผ่านเจค2 เพราะ
// ผลอิ๊งครบหรือไม่ครบก็ได้(ถ้าไม่ครบใส่หมายเหตุ) 

// กรณีไม่ผ่านเจค2 เพราะ
// ผลอิ๊งครบ ขาดอย่างใดอย่างหนึ่ง -> ขึ้นว่า ยังไม่ผ่านโปรเจค2(ใส่หมายเหตุว่าทำไมยังไม่ผ่าน)

//เจค2 กรณียังสอบอิ๊งไม่ครบคู่ และสอบเจคแล้ว เกรดออกแล้ว จะยังไม่จบ เพราะต้องรอให้อิ๊งครบก่อน
import { useState, useEffect } from 'react';
import axios from 'axios';
import Navbar from '../component/navbar';

function AllProject() {
    return (
        <div>
            <Navbar />
        </div>
    )
}

export default AllProject;